xBackups/TestData.txt

POST:/
<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:createUserProfile soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://web.btcomi4.devenv1.bt.co.uk:65082/btcomWSProfilemgmt"><hubServiceMessage href="#id0"/></ns1:createUserProfile><multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:HubServiceMessage" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="java:com.bt.btcom.common.dto.profilemgmt"><standardHeader href="#id1"/><serviceBusinessMessage href="#id2"/></multiRef><multiRef id="id2" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:ServiceBusinessMessage" xmlns:ns3="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><createUserProfile href="#id3"/><getUserProfile xsi:type="ns3:GetUserProfileSrvcBusMsg" xsi:nil="true"/><createAddress href="#id4"/><serviceInputInfo href="#id5"/><account href="#id6"/><updateUserProfile xsi:type="ns3:UpdateUserProfileSrvcBusMsg" xsi:nil="true"/></multiRef><multiRef id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns4:StandardHeaderBlock" xmlns:ns4="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><e2e href="#id7"/><serviceState xsi:type="ns4:ServiceState" xsi:nil="true"/></multiRef><multiRef id="id6" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns5:AccountSrvcBusMsg" xmlns:ns5="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><account xsi:type="ns5:AccountsAndLinesDTO" xsi:nil="true"/></multiRef><multiRef id="id4" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns6:CreateAddressSrvcBusMsg" xmlns:ns6="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><address xsi:type="ns6:AddressDTO" xsi:nil="true"/></multiRef><multiRef id="id3" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns7:CreateUserProfileSrvcBusMsg" xmlns:ns7="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><userProfile href="#id8"/></multiRef><multiRef id="id5" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns8:ServiceInputInfo" xmlns:ns8="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><addressType xsi:type="xsd:string" xsi:nil="true"/><username xsi:type="xsd:string">Ensia123</username></multiRef><multiRef id="id7" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns9:E2E" xmlns:ns9="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><e2eData xsi:type="xsd:string">data</e2eData></multiRef><multiRef id="id8" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns10:ProfileDTO" xmlns:ns10="java:com.bt.btcom.common.dto.profilemgmt" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><mobileNumber xsi:type="xsd:string">9850012345</mobileNumber><firstName xsi:type="xsd:string">Ensia</firstName><password xsi:type="xsd:string">password</password><userId href="#id9"/><langPreference xsi:type="xsd:string">ENGLISH</langPreference><ein xsi:type="xsd:string">ein00123</ein><mainOfcPhoNum xsi:type="xsd:string">0123456789</mainOfcPhoNum><pin xsi:type="xsd:string">pin00123</pin><securityAnswer xsi:type="xsd:string">SecurityAnswer</securityAnswer><securityQuestion xsi:type="xsd:string">Please SecurityQuestion</securityQuestion><preferredName xsi:type="xsd:string">eCommerce</preferredName><emailConsent xsi:type="xsd:string">emailConsent</emailConsent><lastName xsi:type="xsd:string">group</lastName><businessSector xsi:type="xsd:string">IT</businessSector><email xsi:type="xsd:string">samtaj@techmahindra.com</email><pensionerId xsi:type="xsd:string">pid</pensionerId><altContactNumber xsi:type="xsd:string">09890012345</altContactNumber><businessSubSector xsi:type="xsd:string">IT</businessSubSector><contactNumber xsi:type="xsd:string">09890123456</contactNumber><title xsi:type="xsd:string">title</title><companyName xsi:type="xsd:string">TM</companyName><custType xsi:type="xsd:string">BTB</custType><memorableDate xsi:type="xsd:date" xsi:nil="true"/><memorableEvent xsi:type="xsd:string" xsi:nil="true"/></multiRef><multiRef id="id9" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:long" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">56</multiRef></soapenv:Body></soapenv:Envelope>
HEADER:Accept:"application/soap+xml, application/dime, multipart/related, text/*"
HEADER:Host:"localhost:1999"
HEADER:Pragma:"no-cache"
HEADER:User-agent:"Axis/1.3"
HEADER:Content-type:"text/xml; charset=utf-8"
HEADER:Soapaction:""""
HEADER:Content-length:"5001"
HEADER:Cache-control:"no-cache"